; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob88) (:domain depot)
(:objects
	depot0 - depot
	distributor0 distributor1 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 - crate
	hoist0 hoist1 hoist2 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate9)
	(at pallet1 distributor0)
	(clear crate7)
	(at pallet2 distributor1)
	(clear crate10)
	(at truck0 distributor1)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 455)
	(at truck1 depot0)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 304)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at hoist2 distributor1)
	(available hoist2)
	(at crate0 depot0)
	(on crate0 pallet0)
	(= (weight crate0) 64)
	(at crate1 distributor0)
	(on crate1 pallet1)
	(= (weight crate1) 87)
	(at crate2 depot0)
	(on crate2 crate0)
	(= (weight crate2) 6)
	(at crate3 depot0)
	(on crate3 crate2)
	(= (weight crate3) 11)
	(at crate4 depot0)
	(on crate4 crate3)
	(= (weight crate4) 35)
	(at crate5 depot0)
	(on crate5 crate4)
	(= (weight crate5) 22)
	(at crate6 distributor1)
	(on crate6 pallet2)
	(= (weight crate6) 63)
	(at crate7 distributor0)
	(on crate7 crate1)
	(= (weight crate7) 95)
	(at crate8 distributor1)
	(on crate8 crate6)
	(= (weight crate8) 88)
	(at crate9 depot0)
	(on crate9 crate5)
	(= (weight crate9) 68)
	(at crate10 distributor1)
	(on crate10 crate8)
	(= (weight crate10) 26)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 pallet0)
		(on crate1 crate0)
		(on crate2 crate1)
		(on crate4 crate8)
		(on crate7 pallet1)
		(on crate8 crate9)
		(on crate9 pallet2)
		(on crate10 crate7)
	)
)

(:metric minimize (total-time)))

; plan
1. (lift hoist2 crate10 crate8 distributor1)
   deleted: (at crate10 distributor1) (clear crate10) (available hoist2) (on crate10 crate8)
   added: (lifting hoist2 crate10) (clear crate8)
   changed: (fuel-cost) from 0 to 1
   goals met: 1 of 8
2. (load hoist2 crate10 truck0 distributor1)
   deleted: (lifting hoist2 crate10)
   added: (in crate10 truck0) (available hoist2)
   changed: (current_load truck0) from 0 to 26
   goals met: 1 of 8
3. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 1 to 11
   goals met: 1 of 8
4. (unload hoist1 crate10 truck0 distributor0)
   deleted: (in crate10 truck0) (available hoist1)
   added: (lifting hoist1 crate10)
   changed: (current_load truck0) from 26 to 0
   goals met: 1 of 8
5. (lift hoist2 crate8 crate6 distributor1)
   deleted: (at crate8 distributor1) (clear crate8) (available hoist2) (on crate8 crate6)
   added: (lifting hoist2 crate8) (clear crate6)
   changed: (fuel-cost) from 11 to 12
   goals met: 1 of 8
6. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 12 to 22
   goals met: 1 of 8
7. (load hoist2 crate8 truck0 distributor1)
   deleted: (lifting hoist2 crate8)
   added: (in crate8 truck0) (available hoist2)
   changed: (current_load truck0) from 0 to 88
   goals met: 1 of 8
8. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 22 to 32
   goals met: 1 of 8
9. (lift hoist0 crate9 crate5 depot0)
   deleted: (at crate9 depot0) (clear crate9) (available hoist0) (on crate9 crate5)
   added: (lifting hoist0 crate9) (clear crate5)
   changed: (fuel-cost) from 32 to 33
   goals met: 1 of 8
10. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 33 to 43
   goals met: 1 of 8
11. (lift hoist2 crate6 pallet2 distributor1)
   deleted: (at crate6 distributor1) (clear crate6) (available hoist2) (on crate6 pallet2)
   added: (lifting hoist2 crate6) (clear pallet2)
   changed: (fuel-cost) from 43 to 44
   goals met: 1 of 8
12. (load hoist2 crate6 truck1 distributor1)
   deleted: (lifting hoist2 crate6)
   added: (in crate6 truck1) (available hoist2)
   changed: (current_load truck1) from 0 to 63
   goals met: 1 of 8
13. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 44 to 54
   goals met: 1 of 8
14. (load hoist0 crate9 truck0 depot0)
   deleted: (lifting hoist0 crate9)
   added: (in crate9 truck0) (available hoist0)
   changed: (current_load truck0) from 88 to 156
   goals met: 1 of 8
15. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 54 to 64
   goals met: 1 of 8
16. (unload hoist2 crate9 truck0 distributor1)
   deleted: (in crate9 truck0) (available hoist2)
   added: (lifting hoist2 crate9)
   changed: (current_load truck0) from 156 to 88
   goals met: 1 of 8
17. (drop hoist2 crate9 pallet2 distributor1)
   deleted: (lifting hoist2 crate9) (clear pallet2)
   added: (available hoist2) (at crate9 distributor1) (clear crate9) (on crate9 pallet2)
   goals met: 2 of 8
18. (lift hoist0 crate5 crate4 depot0)
   deleted: (at crate5 depot0) (clear crate5) (available hoist0) (on crate5 crate4)
   added: (lifting hoist0 crate5) (clear crate4)
   changed: (fuel-cost) from 64 to 65
   goals met: 2 of 8
19. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 65 to 75
   goals met: 2 of 8
20. (load hoist0 crate5 truck0 depot0)
   deleted: (lifting hoist0 crate5)
   added: (in crate5 truck0) (available hoist0)
   changed: (current_load truck0) from 88 to 110
   goals met: 2 of 8
21. (lift hoist0 crate4 crate3 depot0)
   deleted: (at crate4 depot0) (clear crate4) (available hoist0) (on crate4 crate3)
   added: (lifting hoist0 crate4) (clear crate3)
   changed: (fuel-cost) from 75 to 76
   goals met: 2 of 8
22. (load hoist0 crate4 truck0 depot0)
   deleted: (lifting hoist0 crate4)
   added: (in crate4 truck0) (available hoist0)
   changed: (current_load truck0) from 110 to 145
   goals met: 2 of 8
23. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 76 to 86
   goals met: 2 of 8
24. (unload hoist2 crate8 truck0 distributor1)
   deleted: (in crate8 truck0) (available hoist2)
   added: (lifting hoist2 crate8)
   changed: (current_load truck0) from 145 to 57
   goals met: 2 of 8
25. (drop hoist2 crate8 crate9 distributor1)
   deleted: (lifting hoist2 crate8) (clear crate9)
   added: (available hoist2) (at crate8 distributor1) (clear crate8) (on crate8 crate9)
   goals met: 3 of 8
26. (unload hoist2 crate4 truck0 distributor1)
   deleted: (in crate4 truck0) (available hoist2)
   added: (lifting hoist2 crate4)
   changed: (current_load truck0) from 57 to 22
   goals met: 3 of 8
27. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 86 to 96
   goals met: 3 of 8
28. (drop hoist2 crate4 crate8 distributor1)
   deleted: (lifting hoist2 crate4) (clear crate8)
   added: (available hoist2) (at crate4 distributor1) (clear crate4) (on crate4 crate8)
   goals met: 4 of 8
29. (lift hoist0 crate3 crate2 depot0)
   deleted: (at crate3 depot0) (clear crate3) (available hoist0) (on crate3 crate2)
   added: (lifting hoist0 crate3) (clear crate2)
   changed: (fuel-cost) from 96 to 97
   goals met: 4 of 8
30. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 97 to 107
   goals met: 4 of 8
31. (load hoist0 crate3 truck0 depot0)
   deleted: (lifting hoist0 crate3)
   added: (in crate3 truck0) (available hoist0)
   changed: (current_load truck0) from 22 to 33
   goals met: 4 of 8
32. (lift hoist0 crate2 crate0 depot0)
   deleted: (at crate2 depot0) (clear crate2) (available hoist0) (on crate2 crate0)
   added: (lifting hoist0 crate2) (clear crate0)
   changed: (fuel-cost) from 107 to 108
   goals met: 4 of 8
33. (load hoist0 crate2 truck0 depot0)
   deleted: (lifting hoist0 crate2)
   added: (in crate2 truck0) (available hoist0)
   changed: (current_load truck0) from 33 to 39
   goals met: 4 of 8
34. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 108 to 118
   goals met: 4 of 8
35. (load hoist1 crate10 truck0 distributor0)
   deleted: (lifting hoist1 crate10)
   added: (in crate10 truck0) (available hoist1)
   changed: (current_load truck0) from 39 to 65
   goals met: 4 of 8
36. (lift hoist1 crate7 crate1 distributor0)
   deleted: (at crate7 distributor0) (clear crate7) (available hoist1) (on crate7 crate1)
   added: (lifting hoist1 crate7) (clear crate1)
   changed: (fuel-cost) from 118 to 119
   goals met: 4 of 8
37. (load hoist1 crate7 truck0 distributor0)
   deleted: (lifting hoist1 crate7)
   added: (in crate7 truck0) (available hoist1)
   changed: (current_load truck0) from 65 to 160
   goals met: 4 of 8
38. (lift hoist1 crate1 pallet1 distributor0)
   deleted: (at crate1 distributor0) (clear crate1) (available hoist1) (on crate1 pallet1)
   added: (lifting hoist1 crate1) (clear pallet1)
   changed: (fuel-cost) from 119 to 120
   goals met: 4 of 8
39. (load hoist1 crate1 truck0 distributor0)
   deleted: (lifting hoist1 crate1)
   added: (in crate1 truck0) (available hoist1)
   changed: (current_load truck0) from 160 to 247
   goals met: 4 of 8
40. (unload hoist1 crate7 truck0 distributor0)
   deleted: (in crate7 truck0) (available hoist1)
   added: (lifting hoist1 crate7)
   changed: (current_load truck0) from 247 to 152
   goals met: 4 of 8
41. (drop hoist1 crate7 pallet1 distributor0)
   deleted: (lifting hoist1 crate7) (clear pallet1)
   added: (available hoist1) (at crate7 distributor0) (clear crate7) (on crate7 pallet1)
   goals met: 5 of 8
42. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 120 to 130
   goals met: 5 of 8
43. (unload hoist0 crate1 truck0 depot0)
   deleted: (in crate1 truck0) (available hoist0)
   added: (lifting hoist0 crate1)
   changed: (current_load truck0) from 152 to 65
   goals met: 5 of 8
44. (drop hoist0 crate1 crate0 depot0)
   deleted: (lifting hoist0 crate1) (clear crate0)
   added: (available hoist0) (at crate1 depot0) (clear crate1) (on crate1 crate0)
   goals met: 6 of 8
45. (unload hoist0 crate2 truck0 depot0)
   deleted: (in crate2 truck0) (available hoist0)
   added: (lifting hoist0 crate2)
   changed: (current_load truck0) from 65 to 59
   goals met: 6 of 8
46. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 130 to 140
   goals met: 6 of 8
47. (unload hoist1 crate10 truck0 distributor0)
   deleted: (in crate10 truck0) (available hoist1)
   added: (lifting hoist1 crate10)
   changed: (current_load truck0) from 59 to 33
   goals met: 6 of 8
48. (drop hoist0 crate2 crate1 depot0)
   deleted: (lifting hoist0 crate2) (clear crate1)
   added: (available hoist0) (at crate2 depot0) (clear crate2) (on crate2 crate1)
   goals met: 7 of 8
49. (drop hoist1 crate10 crate7 distributor0)
   deleted: (lifting hoist1 crate10) (clear crate7)
   added: (available hoist1) (at crate10 distributor0) (clear crate10) (on crate10 crate7)
   goals met: 8 of 8
